shared/config/emacs/config.org
* Completion
#+begin_src emacs-lisp :tangle lisp/tsp-completion.el
;;; tsp-completion.el --- Completion and navigation -*- lexical-binding: t; -*-
;;; Code:

;; This file is tangled from ../config.org. Edit that file instead.

(use-package vertico
  :ensure t
  :demand t
  :config
  (vertico-mode))

(use-package orderless
  :ensure t
  :init
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles basic partial-completion)))))

(use-package marginalia
  :ensure t
  :demand t
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))
  :config
  (marginalia-mode))

(defun tsp/yank-from-kill-ring ()
  "Yank from the Emacs kill ring, ignoring the system clipboard."
  (interactive)
  (let ((select-enable-clipboard nil)
        (select-enable-primary nil))
    (yank)))

(defun tsp/clipboard-command-text (program &rest args)
  "Return clipboard text from PROGRAM called with ARGS."
  (when (executable-find program)
    (with-temp-buffer
      (when (zerop (apply #'call-process program nil t nil args))
        (buffer-string)))))

(defun tsp/system-clipboard-text ()
  "Return the current system clipboard text."
  (or (tsp/clipboard-command-text "wl-paste" "--no-newline")
      (tsp/clipboard-command-text "xclip" "-selection" "clipboard" "-out")
      (tsp/clipboard-command-text "xsel" "--clipboard" "--output")
      (tsp/clipboard-command-text "pbpaste")
      (and (fboundp 'gui-get-selection)
           (gui-get-selection 'CLIPBOARD 'UTF8_STRING))
      (and (fboundp 'gui-get-selection)
           (gui-get-selection 'CLIPBOARD 'STRING))
      (and (fboundp 'x-get-selection)
           (x-get-selection 'CLIPBOARD 'UTF8_STRING))
      (and (fboundp 'x-get-selection)
           (x-get-selection 'CLIPBOARD 'STRING))
      (user-error "No system clipboard text available")))

(defun tsp/yank-from-system-clipboard ()
  "Insert the current system clipboard text."
  (interactive)
  (push-mark)
  (insert-for-yank (tsp/system-clipboard-text)))

(defun tsp/consult-system-clipboard-yank-pop ()
  "Run `consult-yank-pop' using the current system clipboard text."
  (interactive)
  (let* ((text (tsp/system-clipboard-text))
         (kill-ring (list text))
         (kill-ring-yank-pointer kill-ring))
    (consult-yank-pop)))

(use-package consult
  :ensure t
  :bind
  (("C-s" . consult-line)
   ("C-y" . tsp/yank-from-kill-ring)
   ("C-S-y" . tsp/yank-from-system-clipboard)
   ("C-Y" . tsp/yank-from-system-clipboard)
   ("C-x b" . consult-buffer)
   ("C-c h" . consult-history)
   ("C-c m" . consult-mode-command)
   ("C-c k" . consult-kmacro)
   ("M-y" . consult-yank-pop)
   ("M-S-y" . tsp/consult-system-clipboard-yank-pop)
   ("M-Y" . tsp/consult-system-clipboard-yank-pop)
   ("M-g g" . consult-goto-line)
   ("M-g M-g" . consult-goto-line)
   ("M-g o" . consult-outline)
   ("M-g i" . consult-imenu)
   ("M-s g" . consult-grep)
   ("M-s r" . consult-ripgrep)
   ("M-s f" . consult-find)))

(use-package corfu
  :ensure t
  :demand t
  :init
  (setq corfu-cycle t
        corfu-auto t
        corfu-auto-prefix 2
        corfu-auto-delay 0.2)
  :config
  (global-corfu-mode))

(use-package which-key
  :ensure t
  :demand t
  :init
  (setq which-key-idle-delay 0.5)
  :config
  (which-key-mode))

(provide 'tsp-completion)
;;; tsp-completion.el ends here
#+end_src

* Org
#+begin_src emacs-lisp :tangle lisp/tsp-org.el
;;; tsp-org.el --- Org configuration -*- lexical-binding: t; -*-
;;; Code:

;; This file is tangled from ../config.org. Edit that file instead.

(defun tsp/org-mode-setup ()
  "Custom setup for Org mode."
  (setq fill-column 80)
  (auto-fill-mode 1)
  (display-fill-column-indicator-mode 1))

(defun tsp/org-redisplay-inline-images ()
  "Refresh inline images after evaluating an Org source block."
  (when (derived-mode-p 'org-mode)
    (org-redisplay-inline-images)))

(use-package org
  :ensure nil
  :bind
  (("C-c a" . org-agenda)
   ("C-c c" . org-capture)
   ("C-c l" . org-store-link))
  :hook
  ((org-mode . tsp/org-mode-setup)
   (org-babel-after-execute . tsp/org-redisplay-inline-images))
  :init
  (setq org-startup-indented nil
        org-hide-leading-stars nil
        org-hide-emphasis-markers nil
        org-startup-folded 'show2levels
        org-cycle-separator-lines 0
        org-fontify-quote-and-verse-blocks nil
        org-fontify-whole-heading-line nil
        org-fontify-done-headline nil
        org-src-fontify-natively nil
        org-fold-catch-invisible-edits 'smart
        org-insert-heading-respect-content t
        org-M-RET-may-split-line '((default . nil))
        org-special-ctrl-a/e t
        org-special-ctrl-k t
        org-cycle-emulate-tab 'white
        org-src-tab-acts-natively t
        org-use-speed-commands t
        org-return-follows-link t
        org-list-allow-alphabetical t
        org-use-sub-superscripts '{}
        org-log-done 'time
        org-log-into-drawer t
        org-outline-path-complete-in-steps nil
        org-refile-use-outline-path 'file
        org-refile-use-cache t
        org-ellipsis " ..."
        org-image-actual-width '(800)
        org-export-with-smart-quotes t)
  :config
  (require 'org-tempo)
  (dolist (template '(("el" . "src emacs-lisp")
                      ("py" . "src python")
                      ("sh" . "src shell")))
    (add-to-list 'org-structure-template-alist template))
  (when (boundp 'org-file-apps-gnu)
    (setcdr (assq t org-file-apps-gnu) 'browse-url-xdg-open)))

(use-package verb
  :ensure t
  :after org
  :config
  (define-key org-mode-map (kbd "C-c C-r") verb-command-map))

(provide 'tsp-org)
;;; tsp-org.el ends here
#+end_src

